//*****************************************************************************
//!	@file	MidairStateBase.h
//!	@brief	蹴鞠の空中の基本状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_MIDAIR_STATE_BASE__
#define __GM31_MIDAIR_STATE_BASE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "SackStateBase.h"

//=============================================================================
//!	@class	MidairStateBase
//!	@brief 蹴鞠の空中の基本状態クラス
//=============================================================================
class MidairStateBase : public SackStateBase
{
public:
	MidairStateBase(SACK_STATE state) : SackStateBase(state){};
	void Action(CSackBase* player);			//処理関数
	void PostAction(CSackBase* player);		//後処理関数

};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************