//*****************************************************************************
//!	@file	MidairStateBase.h
//!	@brief	R‹f‚Ì‹ó’†‚ÌŠî–{ó‘ÔƒNƒ‰ƒX
//!	@note	
//!	@author	ƒCƒŒƒl@ƒwƒ‹ƒZƒmƒEƒCƒX
//*****************************************************************************

//-----------------------------------------------------------------------------
//	ƒwƒbƒ_|
//-----------------------------------------------------------------------------
# include "MidairStateBase.h"
# include "SackBaseClass.h"
# include "Macros.h"

//==============================================================================
//!	@fn		Action
//!	@brief	R‹f‚Ì‹ó’†‚ÌŠî–{ó‘Ô‚Ìˆ—
//!	@param	CSackBase*	sack		R‹f‚Ö‚Ìƒ|ƒCƒ“ƒ^
//!	@retval	‚È‚µ
//!	@note	
//==============================================================================
void MidairStateBase::Action(CSackBase* sack)
{
	sack->AddImpulse(0, GRAVITY / 15.0f);
	if (sack->GetImpulse().y < -JUMP_FORCE)
		sack->SetImpulseX(0.0f);
}

//==============================================================================
//!	@fn		PostAction
//!	@brief	R‹f‚Ì‹ó’†ó‘Ô‚ÌŒãˆ—
//!	@param	CSackBase*	sack		R‹f‚Ö‚Ìƒ|ƒCƒ“ƒ^
//!	@retval	‚È‚µ
//!	@note	
//==============================================================================
void MidairStateBase::PostAction(CSackBase* sack)
{
	sack->HitWall();
}

//******************************************************************************
//	End of file.
//******************************************************************************