//*****************************************************************************
//!	@file	MoveStateBase.h
//!	@brief	蹴鞠の移動の基本状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_MOVING_STATE_BASE__
#define __GM31_MOVING_STATE_BASE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "MidairStateBase.h"

//=============================================================================
//!	@class	MoveStateBase
//!	@brief 蹴鞠の移動の基本状態クラス
//=============================================================================
class MoveStateBase : public MidairStateBase
{
public:
	MoveStateBase() : MidairStateBase(SACK_MOVE){};
	void Enter(CSackBase* sack);			//開始関数
	void PostAction(CSackBase* sack);		//後処理関数

	char* RenderDebug(void){ return "State : Move"; };
};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************