//*****************************************************************************
//!	@file	NormalStateBase.h
//!	@brief	蹴鞠の普通の基本状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_NORMAL_STATE_BASE__
#define __GM31_NORMAL_STATE_BASE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "SackStateBase.h"

//=============================================================================
//!	@class	NormalStateBase
//!	@brief 蹴鞠の普通の基本状態クラス
//=============================================================================
class NormalStateBase : public SackStateBase
{
public:
	NormalStateBase() :SackStateBase(SACK_NORMAL){};
	void Action(CSackBase* sack);			//処理関数
	void PostAction(CSackBase* sack);		//後処理関数

	char* RenderDebug(void){ return "State : Normal"; };
};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************