//*****************************************************************************
//!	@file	DashingState.h
//!	@brief	プレイヤーのダッシュ状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_DASHING_STATE__
#define __GM31_DASHING_STATE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "PlayerState.h"

//=============================================================================
//!	@class	DashingState
//!	@brief プレイヤーのダッシュ状態クラス
//=============================================================================
class DashingState : public PlayerState
{
public:
	DashingState() : PlayerState(SACK_DASH){};
	void Enter(CSackBase* player);			//開始関数
	void Action(CSackBase* player);			//処理関数
	void PostAction(CSackBase* player);		//後処理関数

	char* RenderDebug(void){ return "State : Dash"; };
};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************