//*****************************************************************************
//!	@file	FallingState.h
//!	@brief	プレイヤーの落下状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_FALLING_STATE__
#define __GM31_FALLING_STATE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "P_MidairState.h"

//=============================================================================
//!	@class	FallingState
//!	@brief プレイヤーの落下状態クラス
//=============================================================================
class FallingState : public MidairState
{
public:
	FallingState() : MidairState(SACK_FALL){};
	void Enter(CSackBase* player);			//開始関数
	void Action(CSackBase* player);			//処理関数
	void PostAction(CSackBase* player);		//後処理関数

	char* RenderDebug(void){ return "State : Falling"; };
};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************