//*****************************************************************************
//!	@file	FlipState.h
//!	@brief	プレイヤーが紐を振り回している様態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_FLIP_STATE__
#define __GM31_FLIP_STATE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "PlayerState.h"

//=============================================================================
//!	@class	FlipState
//!	@brief プレイヤーが紐を振り回している様態クラス
//=============================================================================
class FlipState : public PlayerState
{
public:
	FlipState() : PlayerState(SACK_FLIP){};
	void Enter(CSackBase* player);			//開始関数
	void Action(CSackBase* player);			//処理関数
	void PostAction(CSackBase* player);		//後処理関数

	char* RenderDebug(void){ return "State : Flip"; };
};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************