//*****************************************************************************
//!	@file	JumpingState.h
//!	@brief	プレイヤーのジャンプ状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_JUMPING_STATE__
#define __GM31_JUMPING_STATE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "P_MidairState.h"

//=============================================================================
//!	@class	JumpingState
//!	@brief プレイヤーのジャンプ状態クラス
//=============================================================================
class JumpingState : public MidairState
{
public:
	JumpingState() : MidairState(SACK_JUMP){};
	void Enter(CSackBase* player);			//開始関数
	void Action(CSackBase* player);			//処理関数
	void PostAction(CSackBase* player);		//後処理関数

	char* RenderDebug(void){ return "State : Jumping"; };
};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************