//*****************************************************************************
//!	@file	MidairState.h
//!	@brief	プレイヤーの空中状態クラス
//!	@note	
//!	@author	イレネ　ヘルセノウイス
//*****************************************************************************

#ifndef __GM31_MIDAIR_STATE__
#define __GM31_MIDAIR_STATE__

//-----------------------------------------------------------------------------
//	ヘッダー
//-----------------------------------------------------------------------------
# include "PlayerState.h"

//=============================================================================
//!	@class	MidairState
//!	@brief プレイヤーの空中状態クラス
//=============================================================================
class MidairState : public PlayerState
{
public:
	MidairState(SACK_STATE state) : PlayerState(state){};
	void Enter(CSackBase* player);			//開始関数
	void Action(CSackBase* player);			//処理関数
	void PostAction(CSackBase* player);		//後処理関数

};

#endif

//******************************************************************************
//	End of file.
//******************************************************************************